{
    "What is DBMS used for?":["DBMS, commonly known as Database Management System, is an application system whose main purpose revolves around the data. This is a system that allows its user to store the data, define it, retrieve it and update the information about the data inside the database.","Explanation comes here"],
    "What is meant by a Database?":["Database is a collection of data in some organized way to facilitate its user's to easily access, manage and upload the data.","Explanation comes here"],
    "What is the purpose of normalization in DBMS?":["Normalization is the process of analyzing the relational schemas which are based on their respective functional dependencies and the primary keys in order to fulfill certain properties.","Explanation comes here"],
    "What is the purpose of SQL?":["SQL stands for Structured Query Language whose main purpose is to interact with the relational databases in the form of inserting and updating/modifying the data in the database.","Explanation comes here"],
    "Explain the concepts of a Primary key and Foreign Key.":["Primary Key is used to uniquely identify the records in a database table while Foreign Key is mainly used to link two or more tables together, as this is a particular field(s) in one of the database tables which are the primary key of some other table.","Explanation comes here"],
    "What is the main difference between UNION and UNION ALL?":["UNION and UNION ALL are used to join the data from 2 or more tables but UNION removes duplicate rows and picks the rows which are distinct after combining the data from the tables whereas UNION ALL does not remove the duplicate rows, it just picks all the data from the tables.","Explanation comes here"],
    "What is a join in the SQL?":["A Join is one of the SQL statements which is used to join the data or the rows from 2 or more tables on the basis of a common field/column among them.","Explanation comes here"],
    "What is meant by trigger? Explain with an example.":["Trigger is one of the very important codes or programs which get executed automatically in response to the events that occur in a table or a view. For Example, If a new record is inserted in an employee database then the data gets created automatically in the related tables like salary, department and roles tables.","Explanation comes here"],
    "Explain the Stored Procedure.":["Stored Procedure is a group of SQL statements in the form of a function that has some unique name and is stored in relational database management systems (RDBMS) and can be accessed whenever required.","Explanation comes here"],
    "Where is the LRU cache used in data structure?":["LRU (Least Recently Used) cache to organize items in order of use, enabling you to quickly find out which item hasn't been used for a long time.","Explanation comes here"],
    "Explain the main difference between PUSH and a POP?":["The two main activities, i.e. Pushing and Popping applies the way how data is stored and retrieved in an entity. So if you check in detail, a Push is nothing but a process where data is added to the stack.  On the contrary, a Pop is an activity where data is retrieved from the stack. When we discuss the data retrieval it only considers the topmost available data.","Explanation comes here"],
    "What operations can be performed on a stack?":["Push operation: To add an item to the stack. If the stack is complete, then it is in an overflow condition. Pop operation: It is used to remove an item from the stack. If it's an empty stack, then it is in underflow condition. isEmpty operation: If the stack is empty returns true, else false. Peek or Top operation: This returns the top element of the stack.","Explanation comes here"],
    "Are linked lists considered non-linear or linear data structures?":["It depends on where you plan to use Linked lists. You can consider a linked list for both non-linear and linear data structures. When used for data storage, it is regarded as a non-linear data structure. When used for access strategies, it is considered a linear data structure.","Explanation comes here"],
    "What is an AVL tree?":["An AVL (Adelson, Velskii, and Landi) is a self-balancing binary search tree where the variation of heights of the right and left subtrees of any node is not more than one.","Explanation comes here"],
    "What is a Jagged array?":["Jagged arrays are a particular type of arrays used for storing rows of data of varying lengths to improve efficiency when working with multidimensional arrays.","Explanation comes here"],
    "What is the max heap in the data structure?":["A max heap in a data structure is a complete binary tree where each internal node's value is greater than or equal to that node's children's values.","Explanation comes here"],
    "Explain what is a dequeue?":["A dequeue is nothing but a double-ended queue. Within this structure, the elements can be inserted or deleted from both sides.","Explanation comes here"],
    "Can two stacks be used as a queue? True or False":["TRUE","Explanation comes here"],
    "If the size of the stack is 10 and we try to add the 11th element in the stack then the condition is known as":["Overflow","Explanation comes here"],
    "Which of the following principle does Queue use? LIFO principle FIFO principle Linear tree Ordered array":["FIFO principle","Explanation comes here"]
}